# Greeting message
BOT_DESCRIPTION = '''Привет! 🙂 Я бот, который экономит твоё время в Telegram.

Что я делаю:

🔹 собираю новости из ваших каналов и чатов

🔹 выделяю самое важное

🔹 присылаю готовые сводки за указанный интервал времени

Нажми 👇
'''


TUTORIAL_STEPS = [
    (

'''
Добавить каналы:

• переслать сюда пост из <u>публичного</u> канала

или

• прислать ссылку на канал (можно списком)
        '''.strip()
    ),
    (
        '''
Добавить чаты:

• прислать ссылку на <u>публичный</u> чат

Каналы и чаты можно добавлять сколько угодно и когда угодно ❤️
        '''.strip()
    ),
    (

'''
Сводки:

По умолчанию они будут приходить к вам <u>каждый час</u>, но вы можете изменять интервал.


        '''.strip()
    ),
    (

'''
Фидбек:

Тут можно оставить комментарий или задать вопрос 💬


        '''.strip()
    )
]
