# Greeting message
BOT_DESCRIPTION = '''Привет! 🙂 Я бот, который экономит твоё время в Telegram.

<b>Что я делаю:</b>

🔹 <b>собираю</b> новости из ваших каналов и чатов  
🔹 <b>выделяю</b> самое важное  
🔹 <b>отправляю</b> готовые сводки за указанный интервал времени  

Нажми 👇
'''




TUTORIAL_STEPS = [
    (

'''
Если захочешь добавить каналы, то можно:

• переслать сюда пост из публичного канала
• прислать ссылку (можно целым списком) 
        '''.strip()
    ),
    (
        '''
Чтобы получать сводки по чату, нужно прислать ссылку на этот чат. 

Пересылка сообщений для чатов - не работает.

Каналы и чаты можно добавлять сколько угодно и когда угодно ❤️
        '''.strip()
    ),
    (

'''
По умолчанию, к вам будут приходить сводки каждый час, но вы можете менять интервал.


        '''.strip()
    )
]
